[
    {
        "title": "Denoising-While-Completing Network (DWCNet): Robust Point Cloud Completion Under Corruption",
        "summary": "Point cloud completion is crucial for 3D computer vision tasks in autonomous\ndriving, augmented reality, and robotics. However, obtaining clean and complete\npoint clouds from real-world environments is challenging due to noise and\nocclusions. Consequently, most existing completion networks -- trained on\nsynthetic data -- struggle with real-world degradations. In this work, we\ntackle the problem of completing and denoising highly corrupted partial point\nclouds affected by multiple simultaneous degradations. To benchmark robustness,\nwe introduce the Corrupted Point Cloud Completion Dataset (CPCCD), which\nhighlights the limitations of current methods under diverse corruptions.\nBuilding on these insights, we propose DWCNet (Denoising-While-Completing\nNetwork), a completion framework enhanced with a Noise Management Module (NMM)\nthat leverages contrastive learning and self-attention to suppress noise and\nmodel structural relationships. DWCNet achieves state-of-the-art performance on\nboth clean and corrupted, synthetic and real-world datasets. The dataset and\ncode will be publicly available at\nhttps://github.com/keneniwt/DWCNET-Robust-Point-Cloud-Completion-against-Corruptions",
        "url": "http://arxiv.org/abs/2507.16743v1",
        "published_date": "2025-07-22T16:34:21+00:00",
        "updated_date": "2025-07-22T16:34:21+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Keneni W. Tesema",
            "Lyndon Hill",
            "Mark W. Jones",
            "Gary K. L. Tam"
        ],
        "tldr": "The paper introduces DWCNet, a new point cloud completion network robust to noise and corruptions, along with a new dataset (CPCCD) to benchmark performance under such conditions, demonstrating state-of-the-art results on both synthetic and real-world datasets.",
        "tldr_zh": "该论文介绍了一种新的点云补全网络DWCNet，该网络对噪声和损坏具有鲁棒性，同时还提出了一个新的数据集(CPCCD)，用于衡量在这些条件下的性能，并在合成和真实世界的数据集上展示了最先进的结果。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "VGGT-Long: Chunk it, Loop it, Align it -- Pushing VGGT's Limits on Kilometer-scale Long RGB Sequences",
        "summary": "Foundation models for 3D vision have recently demonstrated remarkable\ncapabilities in 3D perception. However, extending these models to large-scale\nRGB stream 3D reconstruction remains challenging due to memory limitations. In\nthis work, we propose VGGT-Long, a simple yet effective system that pushes the\nlimits of monocular 3D reconstruction to kilometer-scale, unbounded outdoor\nenvironments. Our approach addresses the scalability bottlenecks of existing\nmodels through a chunk-based processing strategy combined with overlapping\nalignment and lightweight loop closure optimization. Without requiring camera\ncalibration, depth supervision or model retraining, VGGT-Long achieves\ntrajectory and reconstruction performance comparable to traditional methods. We\nevaluate our method on KITTI, Waymo, and Virtual KITTI datasets. VGGT-Long not\nonly runs successfully on long RGB sequences where foundation models typically\nfail, but also produces accurate and consistent geometry across various\nconditions. Our results highlight the potential of leveraging foundation models\nfor scalable monocular 3D scene in real-world settings, especially for\nautonomous driving scenarios. Code is available at\nhttps://github.com/DengKaiCQ/VGGT-Long.",
        "url": "http://arxiv.org/abs/2507.16443v1",
        "published_date": "2025-07-22T10:39:04+00:00",
        "updated_date": "2025-07-22T10:39:04+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Kai Deng",
            "Zexin Ti",
            "Jiawei Xu",
            "Jian Yang",
            "Jin Xie"
        ],
        "tldr": "VGGT-Long is proposed to extend monocular 3D reconstruction using foundation models to kilometer-scale RGB sequences by chunking, aligning, and optimizing loop closures, achieving comparable performance to traditional methods without calibration or depth supervision.",
        "tldr_zh": "VGGT-Long 提出了一种基于基础模型的大规模单目3D重建方法，通过分块、对齐和闭环优化，将重建范围扩展到公里级别RGB序列，无需相机标定或深度监督，性能与传统方法相当。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "ThinkAct: Vision-Language-Action Reasoning via Reinforced Visual Latent Planning",
        "summary": "Vision-language-action (VLA) reasoning tasks require agents to interpret\nmultimodal instructions, perform long-horizon planning, and act adaptively in\ndynamic environments. Existing approaches typically train VLA models in an\nend-to-end fashion, directly mapping inputs to actions without explicit\nreasoning, which hinders their ability to plan over multiple steps or adapt to\ncomplex task variations. In this paper, we propose ThinkAct, a dual-system\nframework that bridges high-level reasoning with low-level action execution via\nreinforced visual latent planning. ThinkAct trains a multimodal LLM to generate\nembodied reasoning plans guided by reinforcing action-aligned visual rewards\nbased on goal completion and trajectory consistency. These reasoning plans are\ncompressed into a visual plan latent that conditions a downstream action model\nfor robust action execution on target environments. Extensive experiments on\nembodied reasoning and robot manipulation benchmarks demonstrate that ThinkAct\nenables few-shot adaptation, long-horizon planning, and self-correction\nbehaviors in complex embodied AI tasks.",
        "url": "http://arxiv.org/abs/2507.16815v1",
        "published_date": "2025-07-22T17:59:46+00:00",
        "updated_date": "2025-07-22T17:59:46+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG",
            "cs.RO"
        ],
        "authors": [
            "Chi-Pin Huang",
            "Yueh-Hua Wu",
            "Min-Hung Chen",
            "Yu-Chiang Frank Wang",
            "Fu-En Yang"
        ],
        "tldr": "The paper introduces ThinkAct, a framework using a multimodal LLM for embodied reasoning and action planning, trained with reinforcement learning for improved long-horizon performance and adaptation in VLA tasks.",
        "tldr_zh": "该论文介绍了 ThinkAct，一个使用多模态 LLM 进行具身推理和行动规划的框架，通过强化学习进行训练，以提高 VLA 任务中的长程性能和适应性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "A Target-based Multi-LiDAR Multi-Camera Extrinsic Calibration System",
        "summary": "Extrinsic Calibration represents the cornerstone of autonomous driving. Its\naccuracy plays a crucial role in the perception pipeline, as any errors can\nhave implications for the safety of the vehicle. Modern sensor systems collect\ndifferent types of data from the environment, making it harder to align the\ndata. To this end, we propose a target-based extrinsic calibration system\ntailored for a multi-LiDAR and multi-camera sensor suite. This system enables\ncross-calibration between LiDARs and cameras with limited prior knowledge using\na custom ChArUco board and a tailored nonlinear optimization method. We test\nthe system with real-world data gathered in a warehouse. Results demonstrated\nthe effectiveness of the proposed method, highlighting the feasibility of a\nunique pipeline tailored for various types of sensors.",
        "url": "http://arxiv.org/abs/2507.16621v1",
        "published_date": "2025-07-22T14:15:28+00:00",
        "updated_date": "2025-07-22T14:15:28+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Lorenzo Gentilini",
            "Pierpaolo Serio",
            "Valentina Donzella",
            "Lorenzo Pollini"
        ],
        "tldr": "The paper presents a target-based extrinsic calibration system for multi-LiDAR and multi-camera setups, using a custom ChArUco board and nonlinear optimization, demonstrating effectiveness with real-world data.",
        "tldr_zh": "该论文提出了一种基于目标的外部参数标定系统，用于多激光雷达和多摄像头设置。该系统使用定制的ChArUco板和非线性优化方法，并通过真实世界的数据验证了其有效性。",
        "relevance_score": 9,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Optimization of DNN-based HSI Segmentation FPGA-based SoC for ADS: A Practical Approach",
        "summary": "The use of HSI for autonomous navigation is a promising research field aimed\nat improving the accuracy and robustness of detection, tracking, and scene\nunderstanding systems based on vision sensors. Combining advanced computer\nalgorithms, such as DNNs, with small-size snapshot HSI cameras enhances the\nreliability of these systems. HSI overcomes intrinsic limitations of greyscale\nand RGB imaging in depicting physical properties of targets, particularly\nregarding spectral reflectance and metamerism. Despite promising results in\nHSI-based vision developments, safety-critical systems like ADS demand strict\nconstraints on latency, resource consumption, and security, motivating the\nshift of ML workloads to edge platforms. This involves a thorough\nsoftware/hardware co-design scheme to distribute and optimize the tasks\nefficiently among the limited resources of computing platforms. With respect to\ninference, the over-parameterized nature of DNNs poses significant\ncomputational challenges for real-time on-the-edge deployment. In addition, the\nintensive data preprocessing required by HSI, which is frequently overlooked,\nmust be carefully managed in terms of memory arrangement and inter-task\ncommunication to enable an efficient integrated pipeline design on a SoC. This\nwork presents a set of optimization techniques for the practical co-design of a\nDNN-based HSI segmentation processor deployed on a FPGA-based SoC targeted at\nADS, including key optimizations such as functional software/hardware task\ndistribution, hardware-aware preprocessing, ML model compression, and a\ncomplete pipelined deployment. Applied compression techniques significantly\nreduce the complexity of the designed DNN to 24.34% of the original operations\nand to 1.02% of the original number of parameters, achieving a 2.86x speed-up\nin the inference task without noticeable degradation of the segmentation\naccuracy.",
        "url": "http://arxiv.org/abs/2507.16556v1",
        "published_date": "2025-07-22T13:09:04+00:00",
        "updated_date": "2025-07-22T13:09:04+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.AR",
            "cs.LG",
            "eess.IV"
        ],
        "authors": [
            "Jon Gutiérrez-Zaballa",
            "Koldo Basterretxea",
            "Javier Echanobe"
        ],
        "tldr": "This paper optimizes a DNN-based HSI segmentation processor for autonomous driving systems (ADS) deployed on an FPGA-based SoC, using techniques like hardware-aware preprocessing and model compression to improve latency and resource consumption.",
        "tldr_zh": "本文针对自动驾驶系统(ADS)，优化了部署在基于FPGA的SoC上的基于DNN的HSI分割处理器，采用硬件感知预处理和模型压缩等技术来提高延迟和资源消耗。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Spatial 3D-LLM: Exploring Spatial Awareness in 3D Vision-Language Models",
        "summary": "New era has unlocked exciting possibilities for extending Large Language\nModels (LLMs) to tackle 3D vision-language tasks. However, most existing 3D\nmultimodal LLMs (MLLMs) rely on compressing holistic 3D scene information or\nsegmenting independent objects to perform these tasks, which limits their\nspatial awareness due to insufficient representation of the richness inherent\nin 3D scenes. To overcome these limitations, we propose Spatial 3D-LLM, a 3D\nMLLM specifically designed to enhance spatial awareness for 3D vision-language\ntasks by enriching the spatial embeddings of 3D scenes. Spatial 3D-LLM\nintegrates an LLM backbone with a progressive spatial awareness scheme that\nprogressively captures spatial information as the perception field expands,\ngenerating location-enriched 3D scene embeddings to serve as visual prompts.\nFurthermore, we introduce two novel tasks: 3D object distance measurement and\n3D layout editing, and construct a 3D instruction dataset, MODEL, to evaluate\nthe model's spatial awareness capabilities. Experimental results demonstrate\nthat Spatial 3D-LLM achieves state-of-the-art performance across a wide range\nof 3D vision-language tasks, revealing the improvements stemmed from our\nprogressive spatial awareness scheme of mining more profound spatial\ninformation. Our code is available at\nhttps://github.com/bjshuyuan/Spatial-3D-LLM.",
        "url": "http://arxiv.org/abs/2507.16524v1",
        "published_date": "2025-07-22T12:32:35+00:00",
        "updated_date": "2025-07-22T12:32:35+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Xiaoyan Wang",
            "Zeju Li",
            "Yifan Xu",
            "Jiaxing Qi",
            "Zhifei Yang",
            "Ruifei Ma",
            "Xiangde Liu",
            "Chao Zhang"
        ],
        "tldr": "The paper introduces Spatial 3D-LLM, a 3D vision-language model enhancing spatial awareness through progressive spatial embedding, and presents new tasks and a dataset (MODEL) to evaluate its capabilities, achieving state-of-the-art results.",
        "tldr_zh": "该论文介绍了 Spatial 3D-LLM，一种通过渐进式空间嵌入来增强空间感知的三维视觉语言模型。论文提出了新的任务和一个数据集 (MODEL) 来评估模型的能力，并取得了最先进的结果。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Sparse-View 3D Reconstruction: Recent Advances and Open Challenges",
        "summary": "Sparse-view 3D reconstruction is essential for applications in which dense\nimage acquisition is impractical, such as robotics, augmented/virtual reality\n(AR/VR), and autonomous systems. In these settings, minimal image overlap\nprevents reliable correspondence matching, causing traditional methods, such as\nstructure-from-motion (SfM) and multiview stereo (MVS), to fail. This survey\nreviews the latest advances in neural implicit models (e.g., NeRF and its\nregularized versions), explicit point-cloud-based approaches (e.g., 3D Gaussian\nSplatting), and hybrid frameworks that leverage priors from diffusion and\nvision foundation models (VFMs).We analyze how geometric regularization,\nexplicit shape modeling, and generative inference are used to mitigate\nartifacts such as floaters and pose ambiguities in sparse-view settings.\nComparative results on standard benchmarks reveal key trade-offs between the\nreconstruction accuracy, efficiency, and generalization. Unlike previous\nreviews, our survey provides a unified perspective on geometry-based, neural\nimplicit, and generative (diffusion-based) methods. We highlight the persistent\nchallenges in domain generalization and pose-free reconstruction and outline\nfuture directions for developing 3D-native generative priors and achieving\nreal-time, unconstrained sparse-view reconstruction.",
        "url": "http://arxiv.org/abs/2507.16406v1",
        "published_date": "2025-07-22T09:57:28+00:00",
        "updated_date": "2025-07-22T09:57:28+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Tanveer Younis",
            "Zhanglin Cheng"
        ],
        "tldr": "This survey paper reviews recent advances in sparse-view 3D reconstruction, focusing on neural implicit models, explicit point clouds, and hybrid methods using diffusion and vision foundation models, while also highlighting challenges in domain generalization and pose-free reconstruction.",
        "tldr_zh": "该综述论文回顾了稀疏视图三维重建的最新进展，重点关注神经隐式模型、显式点云以及使用扩散模型和视觉基础模型的混合方法，同时强调了在领域泛化和无姿态重建方面面临的挑战。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "LDRFusion: A LiDAR-Dominant multimodal refinement framework for 3D object detection",
        "summary": "Existing LiDAR-Camera fusion methods have achieved strong results in 3D\nobject detection. To address the sparsity of point clouds, previous approaches\ntypically construct spatial pseudo point clouds via depth completion as\nauxiliary input and adopts a proposal-refinement framework to generate\ndetection results. However, introducing pseudo points inevitably brings noise,\npotentially resulting in inaccurate predictions. Considering the differing\nroles and reliability levels of each modality, we propose LDRFusion, a novel\nLidar-dominant two-stage refinement framework for multi-sensor fusion. The\nfirst stage soley relies on LiDAR to produce accurately localized proposals,\nfollowed by a second stage where pseudo point clouds are incorporated to detect\nchallenging instances. The instance-level results from both stages are\nsubsequently merged. To further enhance the representation of local structures\nin pseudo point clouds, we present a hierarchical pseudo point residual\nencoding module, which encodes neighborhood sets using both feature and\npositional residuals. Experiments on the KITTI dataset demonstrate that our\nframework consistently achieves strong performance across multiple categories\nand difficulty levels.",
        "url": "http://arxiv.org/abs/2507.16224v1",
        "published_date": "2025-07-22T04:35:52+00:00",
        "updated_date": "2025-07-22T04:35:52+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jijun Wang",
            "Yan Wu",
            "Yujian Mo",
            "Junqiao Zhao",
            "Jun Yan",
            "Yinghao Hu"
        ],
        "tldr": "LDRFusion is a novel LiDAR-dominant two-stage 3D object detection framework that uses LiDAR for proposal generation and then refines these proposals with pseudo point clouds, enhancing local structure representation with a hierarchical residual encoding module.",
        "tldr_zh": "LDRFusion 是一种新颖的 LiDAR 主导的两阶段 3D 目标检测框架，它使用 LiDAR 生成 proposal，然后使用伪点云细化这些 proposal，并通过分层残差编码模块增强局部结构表示。",
        "relevance_score": 9,
        "novelty_claim_score": 7,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "LongSplat: Online Generalizable 3D Gaussian Splatting from Long Sequence Images",
        "summary": "3D Gaussian Splatting achieves high-fidelity novel view synthesis, but its\napplication to online long-sequence scenarios is still limited. Existing\nmethods either rely on slow per-scene optimization or fail to provide efficient\nincremental updates, hindering continuous performance. In this paper, we\npropose LongSplat, an online real-time 3D Gaussian reconstruction framework\ndesigned for long-sequence image input. The core idea is a streaming update\nmechanism that incrementally integrates current-view observations while\nselectively compressing redundant historical Gaussians. Crucial to this\nmechanism is our Gaussian-Image Representation (GIR), a representation that\nencodes 3D Gaussian parameters into a structured, image-like 2D format. GIR\nsimultaneously enables efficient fusion of current-view and historical\nGaussians and identity-aware redundancy compression. These functions enable\nonline reconstruction and adapt the model to long sequences without\noverwhelming memory or computational costs. Furthermore, we leverage an\nexisting image compression method to guide the generation of more compact and\nhigher-quality 3D Gaussians. Extensive evaluations demonstrate that LongSplat\nachieves state-of-the-art efficiency-quality trade-offs in real-time novel view\nsynthesis, delivering real-time reconstruction while reducing Gaussian counts\nby 44\\% compared to existing per-pixel Gaussian prediction methods.",
        "url": "http://arxiv.org/abs/2507.16144v1",
        "published_date": "2025-07-22T01:43:51+00:00",
        "updated_date": "2025-07-22T01:43:51+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Guichen Huang",
            "Ruoyu Wang",
            "Xiangjun Gao",
            "Che Sun",
            "Yuwei Wu",
            "Shenghua Gao",
            "Yunde Jia"
        ],
        "tldr": "LongSplat introduces a real-time 3D Gaussian Splatting framework for long image sequences by using a Gaussian-Image Representation (GIR) for efficient online reconstruction and compression, achieving state-of-the-art efficiency-quality trade-offs.",
        "tldr_zh": "LongSplat 提出了一个实时的 3D 高斯溅射框架，用于处理长图像序列。它通过使用高斯图像表示 (GIR) 实现高效的在线重建和压缩，并在效率和质量之间取得了最佳的平衡。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Look Before You Fuse: 2D-Guided Cross-Modal Alignment for Robust 3D Detection",
        "summary": "Integrating LiDAR and camera inputs into a unified Bird's-Eye-View (BEV)\nrepresentation is crucial for enhancing 3D perception capabilities of\nautonomous vehicles. However, current methods are often affected by\nmisalignment between camera and LiDAR features. This misalignment leads to\ninaccurate depth supervision in camera branch and erroneous fusion during\ncross-modal feature aggregation. The root cause of this misalignment lies in\nprojection errors, stemming from minor extrinsic calibration inaccuracies and\nrolling shutter effect of LiDAR during vehicle motion. In this work, our key\ninsight is that these projection errors are predominantly concentrated at\nobject-background boundaries, which are readily identified by 2D detectors.\nBased on this, our main motivation is to utilize 2D object priors to pre-align\ncross-modal features before fusion. To address local misalignment, we propose\nPrior Guided Depth Calibration (PGDC), which leverages 2D priors to correct\nlocal misalignment and preserve correct cross-modal feature pairs. To resolve\nglobal misalignment, we introduce Discontinuity Aware Geometric Fusion (DAGF)\nto process calibrated results from PGDC, suppressing noise and explicitly\nenhancing sharp transitions at object-background boundaries. To effectively\nutilize these transition-aware depth representations, we incorporate Structural\nGuidance Depth Modulator (SGDM), using a gated attention mechanism to\nefficiently fuse aligned depth and image features. Our proposed method achieves\nstate-of-the-art performance on nuScenes validation dataset, with its mAP and\nNDS reaching 71.5% and 73.6% respectively.",
        "url": "http://arxiv.org/abs/2507.16861v1",
        "published_date": "2025-07-21T18:12:22+00:00",
        "updated_date": "2025-07-21T18:12:22+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Xiang Li"
        ],
        "tldr": "This paper proposes a 2D-guided cross-modal alignment method (PGDC, DAGF, SGDM) to address the misalignment problem between LiDAR and camera features in 3D object detection, achieving state-of-the-art performance on the nuScenes dataset.",
        "tldr_zh": "本文提出了一种2D引导的跨模态对齐方法（PGDC, DAGF, SGDM），以解决3D目标检测中LiDAR和相机特征之间的不对齐问题，并在nuScenes数据集上取得了最先进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Improved Semantic Segmentation from Ultra-Low-Resolution RGB Images Applied to Privacy-Preserving Object-Goal Navigation",
        "summary": "User privacy in mobile robotics has become a critical concern. Existing\nmethods typically prioritize either the performance of downstream robotic tasks\nor privacy protection, with the latter often constraining the effectiveness of\ntask execution. To jointly address both objectives, we study semantic-based\nrobot navigation in an ultra-low-resolution setting to preserve visual privacy.\nA key challenge in such scenarios is recovering semantic segmentation from\nultra-low-resolution RGB images. In this work, we introduce a novel fully\njoint-learning method that integrates an agglomerative feature extractor and a\nsegmentation-aware discriminator to solve ultra-low-resolution semantic\nsegmentation, thereby enabling privacy-preserving, semantic object-goal\nnavigation. Our method outperforms different baselines on ultra-low-resolution\nsemantic segmentation and our improved segmentation results increase the\nsuccess rate of the semantic object-goal navigation in a real-world\nprivacy-constrained scenario.",
        "url": "http://arxiv.org/abs/2507.16034v1",
        "published_date": "2025-07-21T19:53:40+00:00",
        "updated_date": "2025-07-21T19:53:40+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Xuying Huang",
            "Sicong Pan",
            "Olga Zatsarynna",
            "Juergen Gall",
            "Maren Bennewitz"
        ],
        "tldr": "The paper introduces a joint-learning method for semantic segmentation from ultra-low-resolution images to enable privacy-preserving robot navigation, improving segmentation and navigation success in privacy-constrained environments.",
        "tldr_zh": "该论文提出了一种联合学习方法，用于从超低分辨率图像中进行语义分割，以实现隐私保护的机器人导航，提高了在隐私受限环境中的分割和导航成功率。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]