[
    {
        "title": "Beyond Frame-wise Tracking: A Trajectory-based Paradigm for Efficient Point Cloud Tracking",
        "summary": "LiDAR-based 3D single object tracking (3D SOT) is a critical task in robotics\nand autonomous systems. Existing methods typically follow frame-wise motion\nestimation or a sequence-based paradigm. However, the two-frame methods are\nefficient but lack long-term temporal context, making them vulnerable in sparse\nor occluded scenes, while sequence-based methods that process multiple point\nclouds gain robustness at a significant computational cost. To resolve this\ndilemma, we propose a novel trajectory-based paradigm and its instantiation,\nTrajTrack. TrajTrack is a lightweight framework that enhances a base two-frame\ntracker by implicitly learning motion continuity from historical bounding box\ntrajectories alone-without requiring additional, costly point cloud inputs. It\nfirst generates a fast, explicit motion proposal and then uses an implicit\nmotion modeling module to predict the future trajectory, which in turn refines\nand corrects the initial proposal. Extensive experiments on the large-scale\nNuScenes benchmark show that TrajTrack achieves new state-of-the-art\nperformance, dramatically improving tracking precision by 4.48% over a strong\nbaseline while running at 56 FPS. Besides, we also demonstrate the strong\ngeneralizability of TrajTrack across different base trackers. Video is\navailable at https://www.bilibili.com/video/BV1ahYgzmEWP.",
        "url": "http://arxiv.org/abs/2509.11453v1",
        "published_date": "2025-09-14T21:57:16+00:00",
        "updated_date": "2025-09-14T21:57:16+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.RO"
        ],
        "authors": [
            "BaiChen Fan",
            "Sifan Zhou",
            "Jian Li",
            "Shibo Zhao",
            "Muqing Cao",
            "Qin Wang"
        ],
        "tldr": "The paper introduces TrajTrack, a novel trajectory-based paradigm for efficient LiDAR-based 3D single object tracking, achieving state-of-the-art performance by implicitly learning motion continuity from historical bounding box trajectories without additional point cloud inputs.",
        "tldr_zh": "该论文介绍了一种名为 TrajTrack 的新型基于轨迹的范例，用于高效的基于激光雷达的 3D 单目标跟踪。它通过从历史边界框轨迹中隐式学习运动连续性来实现最先进的性能，而无需额外的点云输入。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]