[
    {
        "title": "TWIST2: Scalable, Portable, and Holistic Humanoid Data Collection System",
        "summary": "Large-scale data has driven breakthroughs in robotics, from language models\nto vision-language-action models in bimanual manipulation. However, humanoid\nrobotics lacks equally effective data collection frameworks. Existing humanoid\nteleoperation systems either use decoupled control or depend on expensive\nmotion capture setups. We introduce TWIST2, a portable, mocap-free humanoid\nteleoperation and data collection system that preserves full whole-body control\nwhile advancing scalability. Our system leverages PICO4U VR for obtaining\nreal-time whole-body human motions, with a custom 2-DoF robot neck (cost around\n$250) for egocentric vision, enabling holistic human-to-humanoid control. We\ndemonstrate long-horizon dexterous and mobile humanoid skills and we can\ncollect 100 demonstrations in 15 minutes with an almost 100% success rate.\nBuilding on this pipeline, we propose a hierarchical visuomotor policy\nframework that autonomously controls the full humanoid body based on egocentric\nvision. Our visuomotor policy successfully demonstrates whole-body dexterous\nmanipulation and dynamic kicking tasks. The entire system is fully reproducible\nand open-sourced at https://yanjieze.com/TWIST2 . Our collected dataset is also\nopen-sourced at https://twist-data.github.io .",
        "url": "http://arxiv.org/abs/2511.02832v1",
        "published_date": "2025-11-04T18:58:35+00:00",
        "updated_date": "2025-11-04T18:58:35+00:00",
        "categories": [
            "cs.RO",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Yanjie Ze",
            "Siheng Zhao",
            "Weizhuo Wang",
            "Angjoo Kanazawa",
            "Rocky Duan",
            "Pieter Abbeel",
            "Guanya Shi",
            "Jiajun Wu",
            "C. Karen Liu"
        ],
        "tldr": "The paper introduces TWIST2, a low-cost, portable, and scalable system for humanoid teleoperation and data collection using VR and a custom robot neck, demonstrating dexterous manipulation and dynamic kicking. They also open-source the system and the collected dataset.",
        "tldr_zh": "该论文介绍了TWIST2，一个低成本、便携且可扩展的类人机器人遥操作和数据收集系统，该系统使用VR和一个定制的机器人颈部，展示了灵巧的操作和动态踢腿。他们还开源了该系统和收集的数据集。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]