[
    {
        "title": "Real-to-Sim Robot Policy Evaluation with Gaussian Splatting Simulation of Soft-Body Interactions",
        "summary": "Robotic manipulation policies are advancing rapidly, but their direct\nevaluation in the real world remains costly, time-consuming, and difficult to\nreproduce, particularly for tasks involving deformable objects. Simulation\nprovides a scalable and systematic alternative, yet existing simulators often\nfail to capture the coupled visual and physical complexity of soft-body\ninteractions. We present a real-to-sim policy evaluation framework that\nconstructs soft-body digital twins from real-world videos and renders robots,\nobjects, and environments with photorealistic fidelity using 3D Gaussian\nSplatting. We validate our approach on representative deformable manipulation\ntasks, including plush toy packing, rope routing, and T-block pushing,\ndemonstrating that simulated rollouts correlate strongly with real-world\nexecution performance and reveal key behavioral patterns of learned policies.\nOur results suggest that combining physics-informed reconstruction with\nhigh-quality rendering enables reproducible, scalable, and accurate evaluation\nof robotic manipulation policies. Website: https://real2sim-eval.github.io/",
        "url": "http://arxiv.org/abs/2511.04665v1",
        "published_date": "2025-11-06T18:52:08+00:00",
        "updated_date": "2025-11-06T18:52:08+00:00",
        "categories": [
            "cs.RO",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Kaifeng Zhang",
            "Shuo Sha",
            "Hanxiao Jiang",
            "Matthew Loper",
            "Hyunjong Song",
            "Guangyan Cai",
            "Zhuo Xu",
            "Xiaochen Hu",
            "Changxi Zheng",
            "Yunzhu Li"
        ],
        "tldr": "This paper introduces a real-to-sim framework for evaluating robot manipulation policies on deformable objects using Gaussian Splatting for photorealistic rendering, showing strong correlation with real-world performance.",
        "tldr_zh": "本文介绍了一种真实到仿真的框架，使用高斯溅射进行逼真的渲染，用于评估机器人操作策略在可变形物体上的表现，结果与真实世界的表现有很强的相关性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]