[
    {
        "title": "GigaBrain-0: A World Model-Powered Vision-Language-Action Model",
        "summary": "Training Vision-Language-Action (VLA) models for generalist robots typically\nrequires large-scale real-world robot data, which is expensive and\ntime-consuming to collect. The inefficiency of physical data collection\nseverely limits the scalability, and generalization capacity of current VLA\nsystems. To address this challenge, we introduce GigaBrain-0, a novel VLA\nfoundation model empowered by world model-generated data (e.g., video\ngeneration, real2real transfer, human transfer, view transfer, sim2real\ntransfer data). By leveraging world models to generate diverse data at scale,\nGigaBrain-0 significantly reduces reliance on real robot data while improving\ncross-task generalization. Our approach further improves policy robustness\nthrough RGBD input modeling and embodied Chain-of-Thought (CoT) supervision,\nenabling the model to reason about spatial geometry, object states, and\nlong-horizon dependencies during task execution. This leads to substantial\ngains in real-world performance on dexterous, long-horizon, and mobile\nmanipulation tasks. Extensive experiments demonstrate that GigaBrain-0 achieves\nsuperior generalization across variations in appearances (e.g., textures,\ncolors), object placements, and camera viewpoints. Additionally, we present\nGigaBrain-0-Small, an optimized lightweight variant designed to run efficiently\non devices such as the NVIDIA Jetson AGX Orin.",
        "url": "http://arxiv.org/abs/2510.19430v1",
        "published_date": "2025-10-22T09:57:13+00:00",
        "updated_date": "2025-10-22T09:57:13+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "GigaBrain Team",
            "Angen Ye",
            "Boyuan Wang",
            "Chaojun Ni",
            "Guan Huang",
            "Guosheng Zhao",
            "Haoyun Li",
            "Jie Li",
            "Jiagang Zhu",
            "Lv Feng",
            "Peng Li",
            "Qiuping Deng",
            "Runqi Ouyang",
            "Wenkang Qin",
            "Xinze Chen",
            "Xiaofeng Wang",
            "Yang Wang",
            "Yifan Li",
            "Yilong Li",
            "Yiran Ding",
            "Yuan Xu",
            "Yun Ye",
            "Yukun Zhou",
            "Zhehao Dong",
            "Zhenan Wang",
            "Zhichao Liu",
            "Zheng Zhu"
        ],
        "tldr": "GigaBrain-0 is a VLA foundation model that leverages world model-generated data to reduce reliance on real robot data, improving generalization and robustness in real-world robotic tasks.",
        "tldr_zh": "GigaBrain-0 是一个 VLA 基础模型，它利用世界模型生成的数据来减少对真实机器人数据的依赖，从而提高真实世界机器人任务中的泛化性和鲁棒性。",
        "relevance_score": 10,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "Seeing Across Views: Benchmarking Spatial Reasoning of Vision-Language Models in Robotic Scenes",
        "summary": "Vision-language models (VLMs) are essential to Embodied AI, enabling robots\nto perceive, reason, and act in complex environments. They also serve as the\nfoundation for the recent Vision-Language-Action (VLA) models. Yet most\nevaluations of VLMs focus on single-view settings, leaving their ability to\nintegrate multi-view information underexplored. At the same time, multi-camera\nsetups are increasingly standard in robotic platforms, as they provide\ncomplementary perspectives to mitigate occlusion and depth ambiguity. Whether\nVLMs can effectively leverage such multi-view inputs for robotic reasoning\ntherefore remains an open question. To bridge this gap, we introduce\nMV-RoboBench, a benchmark specifically designed to evaluate the multi-view\nspatial reasoning capabilities of VLMs in robotic manipulation. MV-RoboBench\nconsists of 1.7k manually curated QA items across eight subtasks, divided into\ntwo primary categories: spatial understanding and robotic execution. We\nevaluate a diverse set of existing VLMs, including both open-source and\nclosed-source models, along with enhanced versions incorporating CoT-inspired\ntechniques. The results show that state-of-the-art models remain far below\nhuman performance, underscoring the substantial challenges VLMs face in\nmulti-view robotic perception. Additionally, our analysis uncovers two key\nfindings: (i) spatial intelligence and robotic task execution are positively\ncorrelated in multi-view robotic scenarios; and (ii) strong performance on\nexisting general-purpose single-view spatial understanding benchmarks does not\nreliably translate to success in the robotic spatial tasks assessed by our\nbenchmark. We release MV-RoboBench as an open resource to foster progress in\nspatially grounded VLMs and VLAs, providing not only data but also a\nstandardized evaluation protocol for multi-view embodied reasoning.",
        "url": "http://arxiv.org/abs/2510.19400v1",
        "published_date": "2025-10-22T09:20:09+00:00",
        "updated_date": "2025-10-22T09:20:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhiyuan Feng",
            "Zhaolu Kang",
            "Qijie Wang",
            "Zhiying Du",
            "Jiongrui Yan",
            "Shubin Shi",
            "Chengbo Yuan",
            "Huizhi Liang",
            "Yu Deng",
            "Qixiu Li",
            "Rushuai Yang",
            "Arctanx An",
            "Leqi Zheng",
            "Weijie Wang",
            "Shawn Chen",
            "Sicheng Xu",
            "Yaobo Liang",
            "Jiaolong Yang",
            "Baining Guo"
        ],
        "tldr": "This paper introduces MV-RoboBench, a new benchmark for evaluating the multi-view spatial reasoning capabilities of Vision-Language Models in robotic manipulation, highlighting the gap between single-view VLM performance and multi-view robotic task success.",
        "tldr_zh": "本文介绍了MV-RoboBench，这是一个新的基准测试，用于评估视觉语言模型在机器人操作中的多视角空间推理能力，强调了单视角VLM性能与多视角机器人任务成功之间的差距。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "$\\nabla$-SDF: Learning Euclidean Signed Distance Functions Online with Gradient-Augmented Octree Interpolation and Neural Residual",
        "summary": "Estimation of signed distance functions (SDFs) from point cloud data has been\nshown to benefit many robot autonomy capabilities, including localization,\nmapping, motion planning, and control. Methods that support online and\nlarge-scale SDF reconstruction tend to rely on discrete volumetric data\nstructures, which affect the continuity and differentiability of the SDF\nestimates. Recently, using implicit features, neural network methods have\ndemonstrated high-fidelity and differentiable SDF reconstruction but they tend\nto be less efficient, can experience catastrophic forgetting and memory\nlimitations in large environments, and are often restricted to truncated SDFs.\nThis work proposes $\\nabla$-SDF, a hybrid method that combines an explicit\nprior obtained from gradient-augmented octree interpolation with an implicit\nneural residual. Our method achieves non-truncated (Euclidean) SDF\nreconstruction with computational and memory efficiency comparable to\nvolumetric methods and differentiability and accuracy comparable to neural\nnetwork methods. Extensive experiments demonstrate that \\methodname{}\noutperforms the state of the art in terms of accuracy and efficiency, providing\na scalable solution for downstream tasks in robotics and computer vision.",
        "url": "http://arxiv.org/abs/2510.18999v1",
        "published_date": "2025-10-21T18:24:45+00:00",
        "updated_date": "2025-10-21T18:24:45+00:00",
        "categories": [
            "cs.RO",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Zhirui Dai",
            "Qihao Qian",
            "Tianxing Fan",
            "Nikolay Atanasov"
        ],
        "tldr": "This paper introduces $\\nabla$-SDF, a hybrid method combining octree interpolation and a neural residual for efficient and accurate Euclidean SDF reconstruction from point clouds, addressing limitations of both volumetric and purely neural network approaches.",
        "tldr_zh": "该论文介绍了一种混合方法$\\nabla$-SDF，它结合了八叉树插值和神经残差，用于从点云中高效准确地重建欧几里德符号距离函数，解决了体积方法和纯神经网络方法的局限性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "Memo: Training Memory-Efficient Embodied Agents with Reinforcement Learning",
        "summary": "To enable embodied agents to operate effectively over extended timeframes, it\nis crucial to develop models that form and access memories to stay\ncontextualized in their environment. In the current paradigm of training\ntransformer-based policies for embodied sequential decision-making tasks,\nvisual inputs often overwhelm the context limits of transformers, while humans\ncan maintain and utilize a lifetime of experience compressed as memories.\nSignificant compression is possible in principle, as much of the input is\nirrelevant and can be abstracted. However, existing approaches predominantly\nfocus on either recurrent models with fixed-size memory or transformers with\nfull-context reliance. In this work, we propose Memo, a transformer-based\narchitecture and training recipe for reinforcement learning (RL) on\nmemory-intensive, long-horizon tasks. Memo incorporates the creation and\nretrieval of memory by interleaving periodic summarization tokens with the\ninputs of a model during training. We demonstrate Memo's effectiveness on a\ngridworld meta-RL benchmark and a multi-object navigation task in\nphoto-realistic indoor settings. Memo outperforms naive long-context\ntransformer baselines while being more compute and storage efficient.\nAdditionally, Memo generalizes better to longer contexts at inference time and\nremains robust in streaming settings, where historical context must be\ntruncated to fit inference constraints.",
        "url": "http://arxiv.org/abs/2510.19732v1",
        "published_date": "2025-10-22T16:24:47+00:00",
        "updated_date": "2025-10-22T16:24:47+00:00",
        "categories": [
            "cs.AI",
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Gunshi Gupta",
            "Karmesh Yadav",
            "Zsolt Kira",
            "Yarin Gal",
            "Rahaf Aljundi"
        ],
        "tldr": "The paper introduces Memo, a transformer-based architecture for reinforcement learning that efficiently manages memory in long-horizon embodied tasks by incorporating periodic summarization tokens, demonstrating improved performance and generalization in gridworld and navigation tasks.",
        "tldr_zh": "本文介绍了一种名为Memo的基于Transformer的强化学习架构，通过结合周期性的总结令牌来有效地管理长时程具身任务中的记忆，并在网格世界和导航任务中展示了改进的性能和泛化能力。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "From Forecasting to Planning: Policy World Model for Collaborative State-Action Prediction",
        "summary": "Despite remarkable progress in driving world models, their potential for\nautonomous systems remains largely untapped: the world models are mostly\nlearned for world simulation and decoupled from trajectory planning. While\nrecent efforts aim to unify world modeling and planning in a single framework,\nthe synergistic facilitation mechanism of world modeling for planning still\nrequires further exploration. In this work, we introduce a new driving paradigm\nnamed Policy World Model (PWM), which not only integrates world modeling and\ntrajectory planning within a unified architecture, but is also able to benefit\nplanning using the learned world knowledge through the proposed action-free\nfuture state forecasting scheme. Through collaborative state-action prediction,\nPWM can mimic the human-like anticipatory perception, yielding more reliable\nplanning performance. To facilitate the efficiency of video forecasting, we\nfurther introduce a dynamically enhanced parallel token generation mechanism,\nequipped with a context-guided tokenizer and an adaptive dynamic focal loss.\nDespite utilizing only front camera input, our method matches or exceeds\nstate-of-the-art approaches that rely on multi-view and multi-modal inputs.\nCode and model weights will be released at\nhttps://github.com/6550Zhao/Policy-World-Model.",
        "url": "http://arxiv.org/abs/2510.19654v1",
        "published_date": "2025-10-22T14:57:51+00:00",
        "updated_date": "2025-10-22T14:57:51+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL",
            "cs.RO"
        ],
        "authors": [
            "Zhida Zhao",
            "Talas Fu",
            "Yifan Wang",
            "Lijun Wang",
            "Huchuan Lu"
        ],
        "tldr": "This paper introduces a Policy World Model (PWM) for autonomous driving that unifies world modeling and trajectory planning, leveraging action-free future state forecasting and a dynamically enhanced parallel token generation mechanism to achieve state-of-the-art performance using only front camera input.",
        "tldr_zh": "本文介绍了一种用于自动驾驶的策略世界模型 (PWM)，它统一了世界建模和轨迹规划，利用无动作的未来状态预测和动态增强的并行令牌生成机制，仅使用前置摄像头输入即可实现最先进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Pragmatic Heterogeneous Collaborative Perception via Generative Communication Mechanism",
        "summary": "Multi-agent collaboration enhances the perception capabilities of individual\nagents through information sharing. However, in real-world applications,\ndifferences in sensors and models across heterogeneous agents inevitably lead\nto domain gaps during collaboration. Existing approaches based on adaptation\nand reconstruction fail to support pragmatic heterogeneous collaboration due to\ntwo key limitations: (1) Intrusive retraining of the encoder or core modules\ndisrupts the established semantic consistency among agents; and (2)\naccommodating new agents incurs high computational costs, limiting scalability.\nTo address these challenges, we present a novel Generative Communication\nmechanism (GenComm) that facilitates seamless perception across heterogeneous\nmulti-agent systems through feature generation, without altering the original\nnetwork, and employs lightweight numerical alignment of spatial information to\nefficiently integrate new agents at minimal cost. Specifically, a tailored\nDeformable Message Extractor is designed to extract spatial message for each\ncollaborator, which is then transmitted in place of intermediate features. The\nSpatial-Aware Feature Generator, utilizing a conditional diffusion model,\ngenerates features aligned with the ego agent's semantic space while preserving\nthe spatial information of the collaborators. These generated features are\nfurther refined by a Channel Enhancer before fusion. Experiments conducted on\nthe OPV2V-H, DAIR-V2X and V2X-Real datasets demonstrate that GenComm\noutperforms existing state-of-the-art methods, achieving an 81\\% reduction in\nboth computational cost and parameter count when incorporating new agents. Our\ncode is available at https://github.com/jeffreychou777/GenComm.",
        "url": "http://arxiv.org/abs/2510.19618v1",
        "published_date": "2025-10-22T14:15:20+00:00",
        "updated_date": "2025-10-22T14:15:20+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junfei Zhou",
            "Penglin Dai",
            "Quanmin Wei",
            "Bingyi Liu",
            "Xiao Wu",
            "Jianping Wang"
        ],
        "tldr": "This paper introduces GenComm, a novel generative communication mechanism for heterogeneous multi-agent perception that addresses domain gaps and scalability issues by generating features aligned with the ego agent's semantic space, achieving significant computational cost reduction.",
        "tldr_zh": "本文介绍了一种新的生成式通信机制GenComm，用于异构多智能体感知，通过生成与自我智能体语义空间对齐的特征，解决了领域差距和可扩展性问题，并显著降低了计算成本。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "VGD: Visual Geometry Gaussian Splatting for Feed-Forward Surround-view Driving Reconstruction",
        "summary": "Feed-forward surround-view autonomous driving scene reconstruction offers\nfast, generalizable inference ability, which faces the core challenge of\nensuring generalization while elevating novel view quality. Due to the\nsurround-view with minimal overlap regions, existing methods typically fail to\nensure geometric consistency and reconstruction quality for novel views. To\ntackle this tension, we claim that geometric information must be learned\nexplicitly, and the resulting features should be leveraged to guide the\nelevating of semantic quality in novel views. In this paper, we introduce\n\\textbf{Visual Gaussian Driving (VGD)}, a novel feed-forward end-to-end\nlearning framework designed to address this challenge. To achieve generalizable\ngeometric estimation, we design a lightweight variant of the VGGT architecture\nto efficiently distill its geometric priors from the pre-trained VGGT to the\ngeometry branch. Furthermore, we design a Gaussian Head that fuses multi-scale\ngeometry tokens to predict Gaussian parameters for novel view rendering, which\nshares the same patch backbone as the geometry branch. Finally, we integrate\nmulti-scale features from both geometry and Gaussian head branches to jointly\nsupervise a semantic refinement model, optimizing rendering quality through\nfeature-consistent learning. Experiments on nuScenes demonstrate that our\napproach significantly outperforms state-of-the-art methods in both objective\nmetrics and subjective quality under various settings, which validates VGD's\nscalability and high-fidelity surround-view reconstruction.",
        "url": "http://arxiv.org/abs/2510.19578v1",
        "published_date": "2025-10-22T13:28:49+00:00",
        "updated_date": "2025-10-22T13:28:49+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junhong Lin",
            "Kangli Wang",
            "Shunzhou Wang",
            "Songlin Fan",
            "Ge Li",
            "Wei Gao"
        ],
        "tldr": "The paper introduces Visual Geometry Gaussian Splatting (VGD), a novel feed-forward framework for high-quality surround-view driving scene reconstruction that explicitly learns geometric information to improve novel view rendering quality, outperforming existing methods on nuScenes.",
        "tldr_zh": "本文介绍了一种名为视觉几何高斯溅射 (VGD) 的新型前馈框架，用于高质量的环视驾驶场景重建。该框架显式学习几何信息以提高新视角的渲染质量，并在 nuScenes 数据集上优于现有方法。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Background Fades, Foreground Leads: Curriculum-Guided Background Pruning for Efficient Foreground-Centric Collaborative Perception",
        "summary": "Collaborative perception enhances the reliability and spatial coverage of\nautonomous vehicles by sharing complementary information across vehicles,\noffering a promising solution to long-tail scenarios that challenge\nsingle-vehicle perception. However, the bandwidth constraints of vehicular\nnetworks make transmitting the entire feature map impractical. Recent methods,\ntherefore, adopt a foreground-centric paradigm, transmitting only predicted\nforeground-region features while discarding the background, which encodes\nessential context. We propose FadeLead, a foreground-centric framework that\novercomes this limitation by learning to encapsulate background context into\ncompact foreground features during training. At the core of our design is a\ncurricular learning strategy that leverages background cues early on but\nprogressively prunes them away, forcing the model to internalize context into\nforeground representations without transmitting background itself. Extensive\nexperiments on both simulated and real-world benchmarks show that FadeLead\noutperforms prior methods under different bandwidth settings, underscoring the\neffectiveness of context-enriched foreground sharing.",
        "url": "http://arxiv.org/abs/2510.19250v1",
        "published_date": "2025-10-22T05:10:26+00:00",
        "updated_date": "2025-10-22T05:10:26+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Yuheng Wu",
            "Xiangbo Gao",
            "Quang Tau",
            "Zhengzhong Tu",
            "Dongman Lee"
        ],
        "tldr": "The paper presents FadeLead, a foreground-centric collaborative perception framework that uses curriculum learning to encapsulate background context into foreground features, improving performance under bandwidth constraints without transmitting the background.",
        "tldr_zh": "该论文提出了FadeLead，一个以前景为中心的协同感知框架，它使用课程学习将背景上下文封装到前景特征中，从而在带宽受限的情况下提高性能，而无需传输背景。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "SFGFusion: Surface Fitting Guided 3D Object Detection with 4D Radar and Camera Fusion",
        "summary": "3D object detection is essential for autonomous driving. As an emerging\nsensor, 4D imaging radar offers advantages as low cost, long-range detection,\nand accurate velocity measurement, making it highly suitable for object\ndetection. However, its sparse point clouds and low resolution limit object\ngeometric representation and hinder multi-modal fusion. In this study, we\nintroduce SFGFusion, a novel camera-4D imaging radar detection network guided\nby surface fitting. By estimating quadratic surface parameters of objects from\nimage and radar data, the explicit surface fitting model enhances spatial\nrepresentation and cross-modal interaction, enabling more reliable prediction\nof fine-grained dense depth. The predicted depth serves two purposes: 1) in an\nimage branch to guide the transformation of image features from perspective\nview (PV) to a unified bird's-eye view (BEV) for multi-modal fusion, improving\nspatial mapping accuracy; and 2) in a surface pseudo-point branch to generate\ndense pseudo-point cloud, mitigating the radar point sparsity. The original\nradar point cloud is also encoded in a separate radar branch. These two point\ncloud branches adopt a pillar-based method and subsequently transform the\nfeatures into the BEV space. Finally, a standard 2D backbone and detection head\nare used to predict object labels and bounding boxes from BEV features.\nExperimental results show that SFGFusion effectively fuses camera and 4D radar\nfeatures, achieving superior performance on the TJ4DRadSet and view-of-delft\n(VoD) object detection benchmarks.",
        "url": "http://arxiv.org/abs/2510.19215v1",
        "published_date": "2025-10-22T03:56:27+00:00",
        "updated_date": "2025-10-22T03:56:27+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xiaozhi Li",
            "Huijun Di",
            "Jian Li",
            "Feng Liu",
            "Wei Liang"
        ],
        "tldr": "SFGFusion is a novel camera-4D radar fusion network for 3D object detection that uses surface fitting to enhance spatial representation and cross-modal interaction. It achieves state-of-the-art performance on two object detection benchmarks.",
        "tldr_zh": "SFGFusion是一种新颖的相机-4D雷达融合网络，用于3D物体检测，它使用表面拟合来增强空间表示和跨模态交互。在两个物体检测基准测试中，它实现了最先进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "GRASPLAT: Enabling dexterous grasping through novel view synthesis",
        "summary": "Achieving dexterous robotic grasping with multi-fingered hands remains a\nsignificant challenge. While existing methods rely on complete 3D scans to\npredict grasp poses, these approaches face limitations due to the difficulty of\nacquiring high-quality 3D data in real-world scenarios. In this paper, we\nintroduce GRASPLAT, a novel grasping framework that leverages consistent 3D\ninformation while being trained solely on RGB images. Our key insight is that\nby synthesizing physically plausible images of a hand grasping an object, we\ncan regress the corresponding hand joints for a successful grasp. To achieve\nthis, we utilize 3D Gaussian Splatting to generate high-fidelity novel views of\nreal hand-object interactions, enabling end-to-end training with RGB data.\nUnlike prior methods, our approach incorporates a photometric loss that refines\ngrasp predictions by minimizing discrepancies between rendered and real images.\nWe conduct extensive experiments on both synthetic and real-world grasping\ndatasets, demonstrating that GRASPLAT improves grasp success rates up to 36.9%\nover existing image-based methods. Project page:\nhttps://mbortolon97.github.io/grasplat/",
        "url": "http://arxiv.org/abs/2510.19200v1",
        "published_date": "2025-10-22T03:19:26+00:00",
        "updated_date": "2025-10-22T03:19:26+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Matteo Bortolon",
            "Nuno Ferreira Duarte",
            "Plinio Moreno",
            "Fabio Poiesi",
            "José Santos-Victor",
            "Alessio Del Bue"
        ],
        "tldr": "GRASPLAT is a novel grasping framework that uses 3D Gaussian Splatting to synthesize realistic hand-object interactions from RGB images, enabling end-to-end training and improving grasp success rates.",
        "tldr_zh": "GRASPLAT 是一种新的抓取框架，它使用 3D 高斯溅射从 RGB 图像中合成逼真的手-物体交互，从而实现端到端训练并提高抓取成功率。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Rethinking Driving World Model as Synthetic Data Generator for Perception Tasks",
        "summary": "Recent advancements in driving world models enable controllable generation of\nhigh-quality RGB videos or multimodal videos. Existing methods primarily focus\non metrics related to generation quality and controllability. However, they\noften overlook the evaluation of downstream perception tasks, which are\n$\\mathbf{really\\ crucial}$ for the performance of autonomous driving. Existing\nmethods usually leverage a training strategy that first pretrains on synthetic\ndata and finetunes on real data, resulting in twice the epochs compared to the\nbaseline (real data only). When we double the epochs in the baseline, the\nbenefit of synthetic data becomes negligible. To thoroughly demonstrate the\nbenefit of synthetic data, we introduce Dream4Drive, a novel synthetic data\ngeneration framework designed for enhancing the downstream perception tasks.\nDream4Drive first decomposes the input video into several 3D-aware guidance\nmaps and subsequently renders the 3D assets onto these guidance maps. Finally,\nthe driving world model is fine-tuned to produce the edited, multi-view\nphotorealistic videos, which can be used to train the downstream perception\nmodels. Dream4Drive enables unprecedented flexibility in generating multi-view\ncorner cases at scale, significantly boosting corner case perception in\nautonomous driving. To facilitate future research, we also contribute a\nlarge-scale 3D asset dataset named DriveObj3D, covering the typical categories\nin driving scenarios and enabling diverse 3D-aware video editing. We conduct\ncomprehensive experiments to show that Dream4Drive can effectively boost the\nperformance of downstream perception models under various training epochs.\nProject: $\\href{https://wm-research.github.io/Dream4Drive/}{this\\ https\\ URL}$",
        "url": "http://arxiv.org/abs/2510.19195v1",
        "published_date": "2025-10-22T03:02:38+00:00",
        "updated_date": "2025-10-22T03:02:38+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Kai Zeng",
            "Zhanqian Wu",
            "Kaixin Xiong",
            "Xiaobao Wei",
            "Xiangyu Guo",
            "Zhenxin Zhu",
            "Kalok Ho",
            "Lijun Zhou",
            "Bohan Zeng",
            "Ming Lu",
            "Haiyang Sun",
            "Bing Wang",
            "Guang Chen",
            "Hangjun Ye",
            "Wentao Zhang"
        ],
        "tldr": "The paper introduces Dream4Drive, a synthetic data generation framework using 3D-aware guidance maps and asset rendering to improve the performance of downstream perception tasks in autonomous driving, particularly in handling corner cases. They also contribute a large-scale 3D asset dataset.",
        "tldr_zh": "该论文介绍了一种名为Dream4Drive的合成数据生成框架，该框架使用3D感知引导图和资产渲染来提高自动驾驶中下游感知任务的性能，尤其是在处理极端情况时。他们还贡献了一个大型3D资产数据集。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Robust Driving QA through Metadata-Grounded Context and Task-Specific Prompts",
        "summary": "We present a two-phase vision-language QA system for autonomous driving that\nanswers high-level perception, prediction, and planning questions. In Phase-1,\na large multimodal LLM (Qwen2.5-VL-32B) is conditioned on six-camera inputs, a\nshort temporal window of history, and a chain-of-thought prompt with few-shot\nexemplars. A self-consistency ensemble (multiple sampled reasoning chains)\nfurther improves answer reliability. In Phase-2, we augment the prompt with\nnuScenes scene metadata (object annotations, ego-vehicle state, etc.) and\ncategory-specific question instructions (separate prompts for perception,\nprediction, planning tasks). In experiments on a driving QA benchmark, our\napproach significantly outperforms the baseline Qwen2.5 models. For example,\nusing 5 history frames and 10-shot prompting in Phase-1 yields 65.1% overall\naccuracy (vs.62.61% with zero-shot); applying self-consistency raises this to\n66.85%. Phase-2 achieves 67.37% overall. Notably, the system maintains 96%\naccuracy under severe visual corruption. These results demonstrate that\ncarefully engineered prompts and contextual grounding can greatly enhance\nhigh-level driving QA with pretrained vision-language models.",
        "url": "http://arxiv.org/abs/2510.19001v1",
        "published_date": "2025-10-21T18:24:59+00:00",
        "updated_date": "2025-10-21T18:24:59+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.RO"
        ],
        "authors": [
            "Seungjun Yu",
            "Junsung Park",
            "Youngsun Lim",
            "Hyunjung Shim"
        ],
        "tldr": "This paper presents a two-phase vision-language QA system for autonomous driving, using carefully engineered prompts and contextual grounding to improve accuracy, especially under visual corruption, achieving significant performance gains on a driving QA benchmark.",
        "tldr_zh": "本文提出了一种用于自动驾驶的双阶段视觉-语言问答系统，通过精心设计的提示和上下文 grounding 来提高准确性，尤其是在视觉损坏的情况下，在驾驶问答基准测试中取得了显著的性能提升。",
        "relevance_score": 9,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "MobiAct: Efficient MAV Action Recognition Using MobileNetV4 with Contrastive Learning and Knowledge Distillation",
        "summary": "Accurate and efficient recognition of Micro Air Vehicle (MAV) motion is\nessential for enabling real-time perception and coordination in autonomous\naerial swarm. However, most existing approaches rely on large, computationally\nintensive models that are unsuitable for resource-limited MAV platforms, which\nresults in a trade-off between recognition accuracy and inference speed. To\naddress these challenges, this paper proposes a lightweight MAV action\nrecognition framework, MobiAct, designed to achieve high accuracy with low\ncomputational cost. Specifically, MobiAct adopts MobileNetV4 as the backbone\nnetwork and introduces a Stage-wise Orthogonal Knowledge Distillation (SOKD)\nstrategy to effectively transfer MAV motion features from a teacher network\n(ResNet18) to a student network, thereby enhancing knowledge transfer\nefficiency. Furthermore, a parameter-free attention mechanism is integrated\ninto the architecture to improve recognition accuracy without increasing model\ncomplexity. In addition, a hybrid loss training strategy is developed to\ncombine multiple loss objectives, which ensures stable and robust optimization\nduring training. Experimental results demonstrate that the proposed MobiAct\nachieves low-energy and low-computation MAV action recognition, while\nmaintaining the fastest action decoding speed among compared methods. Across\nall three self-collected datasets, MobiAct achieves an average recognition\naccuracy of 92.12%, while consuming only 136.16 pJ of energy and processing\nrecognition at a rate of 8.84 actions per second. Notably, MobiAct decodes\nactions up to 2 times faster than the leading method, with highly comparable\nrecognition accuracy, highlighting its superior efficiency in MAV action\nrecognition.",
        "url": "http://arxiv.org/abs/2510.19273v1",
        "published_date": "2025-10-22T06:18:53+00:00",
        "updated_date": "2025-10-22T06:18:53+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhang Nengbo",
            "Ho Hann Woei"
        ],
        "tldr": "The paper introduces MobiAct, a lightweight MAV action recognition framework using MobileNetV4, contrastive learning, and knowledge distillation to achieve high accuracy and low computational cost, outperforming existing methods in speed and energy efficiency.",
        "tldr_zh": "该论文介绍了MobiAct，一个轻量级的MAV动作识别框架，它使用MobileNetV4、对比学习和知识蒸馏来实现高精度和低计算成本，在速度和能效方面优于现有方法。",
        "relevance_score": 6,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Ninja Codes: Neurally Generated Fiducial Markers for Stealthy 6-DoF Tracking",
        "summary": "In this paper we describe Ninja Codes, neurally-generated fiducial markers\nthat can be made to naturally blend into various real-world environments. An\nencoder network converts arbitrary images into Ninja Codes by applying visually\nmodest alterations; the resulting codes, printed and pasted onto surfaces, can\nprovide stealthy 6-DoF location tracking for a wide range of applications\nincluding augmented reality, robotics, motion-based user interfaces, etc. Ninja\nCodes can be printed using off-the-shelf color printers on regular printing\npaper, and can be detected using any device equipped with a modern RGB camera\nand capable of running inference. Using an end-to-end process inspired by prior\nwork on deep steganography, we jointly train a series of network modules that\nperform the creation and detection of Ninja Codes. Through experiments, we\ndemonstrate Ninja Codes' ability to provide reliable location tracking under\ncommon indoor lighting conditions, while successfully concealing themselves\nwithin diverse environmental textures. We expect Ninja Codes to offer\nparticular value in scenarios where the conspicuous appearances of conventional\nfiducial markers make them undesirable for aesthetic and other reasons.",
        "url": "http://arxiv.org/abs/2510.18976v1",
        "published_date": "2025-10-21T18:01:05+00:00",
        "updated_date": "2025-10-21T18:01:05+00:00",
        "categories": [
            "cs.CV",
            "cs.HC"
        ],
        "authors": [
            "Yuichiro Takeuchi",
            "Yusuke Imoto",
            "Shunya Kato"
        ],
        "tldr": "The paper introduces 'Ninja Codes,' visually subtle fiducial markers generated using neural networks for 6-DoF tracking, designed to blend into environments where traditional markers are undesirable.",
        "tldr_zh": "该论文介绍了“忍者码”，一种使用神经网络生成的视觉上不明显的定位信标，用于6自由度跟踪，旨在融入传统信标不适用的环境。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]