[
    {
        "title": "LMAD: Integrated End-to-End Vision-Language Model for Explainable Autonomous Driving",
        "summary": "Large vision-language models (VLMs) have shown promising capabilities in\nscene understanding, enhancing the explainability of driving behaviors and\ninteractivity with users. Existing methods primarily fine-tune VLMs on on-board\nmulti-view images and scene reasoning text, but this approach often lacks the\nholistic and nuanced scene recognition and powerful spatial awareness required\nfor autonomous driving, especially in complex situations. To address this gap,\nwe propose a novel vision-language framework tailored for autonomous driving,\ncalled LMAD. Our framework emulates modern end-to-end driving paradigms by\nincorporating comprehensive scene understanding and a task-specialized\nstructure with VLMs. In particular, we introduce preliminary scene interaction\nand specialized expert adapters within the same driving task structure, which\nbetter align VLMs with autonomous driving scenarios. Furthermore, our approach\nis designed to be fully compatible with existing VLMs while seamlessly\nintegrating with planning-oriented driving systems. Extensive experiments on\nthe DriveLM and nuScenes-QA datasets demonstrate that LMAD significantly boosts\nthe performance of existing VLMs on driving reasoning tasks,setting a new\nstandard in explainable autonomous driving.",
        "url": "http://arxiv.org/abs/2508.12404v1",
        "published_date": "2025-08-17T15:42:54+00:00",
        "updated_date": "2025-08-17T15:42:54+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Nan Song",
            "Bozhou Zhang",
            "Xiatian Zhu",
            "Jiankang Deng",
            "Li Zhang"
        ],
        "tldr": "The paper introduces LMAD, a novel vision-language framework that enhances scene understanding and explainability in autonomous driving by integrating comprehensive scene understanding and task-specialized structures with VLMs, demonstrating significant performance improvements on driving reasoning tasks.",
        "tldr_zh": "该论文介绍了 LMAD，一种新颖的视觉-语言框架，通过将全面的场景理解和任务专业结构与 VLM 集成，增强了自动驾驶中的场景理解和可解释性，并在驾驶推理任务中展示了显著的性能提升。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "DoppDrive: Doppler-Driven Temporal Aggregation for Improved Radar Object Detection",
        "summary": "Radar-based object detection is essential for autonomous driving due to\nradar's long detection range. However, the sparsity of radar point clouds,\nespecially at long range, poses challenges for accurate detection. Existing\nmethods increase point density through temporal aggregation with ego-motion\ncompensation, but this approach introduces scatter from dynamic objects,\ndegrading detection performance. We propose DoppDrive, a novel Doppler-Driven\ntemporal aggregation method that enhances radar point cloud density while\nminimizing scatter. Points from previous frames are shifted radially according\nto their dynamic Doppler component to eliminate radial scatter, with each point\nassigned a unique aggregation duration based on its Doppler and angle to\nminimize tangential scatter. DoppDrive is a point cloud density enhancement\nstep applied before detection, compatible with any detector, and we demonstrate\nthat it significantly improves object detection performance across various\ndetectors and datasets.",
        "url": "http://arxiv.org/abs/2508.12330v1",
        "published_date": "2025-08-17T11:24:46+00:00",
        "updated_date": "2025-08-17T11:24:46+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yuval Haitman",
            "Oded Bialer"
        ],
        "tldr": "DoppDrive is a novel radar point cloud enhancement method that uses Doppler information to minimize scatter during temporal aggregation, improving object detection performance for autonomous driving.",
        "tldr_zh": "DoppDrive 是一种新型雷达点云增强方法，它利用多普勒信息来最大限度地减少时间聚合期间的散射，从而提高自动驾驶的物体检测性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]