[
    {
        "title": "AnchorDream: Repurposing Video Diffusion for Embodiment-Aware Robot Data Synthesis",
        "summary": "The collection of large-scale and diverse robot demonstrations remains a major bottleneck for imitation learning, as real-world data acquisition is costly and simulators offer limited diversity and fidelity with pronounced sim-to-real gaps. While generative models present an attractive solution, existing methods often alter only visual appearances without creating new behaviors, or suffer from embodiment inconsistencies that yield implausible motions. To address these limitations, we introduce AnchorDream, an embodiment-aware world model that repurposes pretrained video diffusion models for robot data synthesis. AnchorDream conditions the diffusion process on robot motion renderings, anchoring the embodiment to prevent hallucination while synthesizing objects and environments consistent with the robot's kinematics. Starting from only a handful of human teleoperation demonstrations, our method scales them into large, diverse, high-quality datasets without requiring explicit environment modeling. Experiments show that the generated data leads to consistent improvements in downstream policy learning, with relative gains of 36.4% in simulator benchmarks and nearly double performance in real-world studies. These results suggest that grounding generative world models in robot motion provides a practical path toward scaling imitation learning.",
        "url": "http://arxiv.org/abs/2512.11797v1",
        "published_date": "2025-12-12T18:59:45+00:00",
        "updated_date": "2025-12-12T18:59:45+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Junjie Ye",
            "Rong Xue",
            "Basile Van Hoorick",
            "Pavel Tokmakov",
            "Muhammad Zubair Irshad",
            "Yue Wang",
            "Vitor Guizilini"
        ],
        "tldr": "AnchorDream repurposes video diffusion models conditioned on robot motion to synthesize diverse and high-quality robot data for imitation learning, achieving significant performance gains in both simulation and real-world experiments.",
        "tldr_zh": "AnchorDream通过对机器人运动进行条件约束的视频扩散模型，合成多样且高质量的机器人数据用于模仿学习，并在模拟和真实世界的实验中取得了显著的性能提升。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]