[
    {
        "title": "Radar2Shape: 3D Shape Reconstruction from High-Frequency Radar using Multiresolution Signed Distance Functions",
        "summary": "Determining the shape of 3D objects from high-frequency radar signals is analytically complex but critical for commercial and aerospace applications. Previous deep learning methods have been applied to radar modeling; however, they often fail to represent arbitrary shapes or have difficulty with real-world radar signals which are collected over limited viewing angles. Existing methods in optical 3D reconstruction can generate arbitrary shapes from limited camera views, but struggle when they naively treat the radar signal as a camera view. In this work, we present Radar2Shape, a denoising diffusion model that handles a partially observable radar signal for 3D reconstruction by correlating its frequencies with multiresolution shape features. Our method consists of a two-stage approach: first, Radar2Shape learns a regularized latent space with hierarchical resolutions of shape features, and second, it diffuses into this latent space by conditioning on the frequencies of the radar signal in an analogous coarse-to-fine manner. We demonstrate that Radar2Shape can successfully reconstruct arbitrary 3D shapes even from partially-observed radar signals, and we show robust generalization to two different simulation methods and real-world data. Additionally, we release two synthetic benchmark datasets to encourage future research in the high-frequency radar domain so that models like Radar2Shape can safely be adapted into real-world radar systems.",
        "url": "http://arxiv.org/abs/2511.17484v1",
        "published_date": "2025-11-21T18:40:03+00:00",
        "updated_date": "2025-11-21T18:40:03+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Neel Sortur",
            "Justin Goodwin",
            "Purvik Patel",
            "Luis Enrique Martinez",
            "Tzofi Klinghoffer",
            "Rajmonda S. Caceres",
            "Robin Walters"
        ],
        "tldr": "Radar2Shape is a denoising diffusion model that reconstructs 3D shapes from partially observed high-frequency radar signals by correlating radar frequencies with multiresolution shape features, demonstrating generalization to simulated and real-world data.",
        "tldr_zh": "Radar2Shape是一种去噪扩散模型，它通过将雷达频率与多分辨率形状特征相关联，从部分观察到的高频雷达信号中重建3D形状，并展示了对模拟和真实世界数据的泛化能力。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]