[
    {
        "title": "DriveQA: Passing the Driving Knowledge Test",
        "summary": "If a Large Language Model (LLM) were to take a driving knowledge test today,\nwould it pass? Beyond standard spatial and visual question-answering (QA) tasks\non current autonomous driving benchmarks, driving knowledge tests require a\ncomplete understanding of all traffic rules, signage, and right-of-way\nprinciples. To pass this test, human drivers must discern various edge cases\nthat rarely appear in real-world datasets. In this work, we present DriveQA, an\nextensive open-source text and vision-based benchmark that exhaustively covers\ntraffic regulations and scenarios. Through our experiments using DriveQA, we\nshow that (1) state-of-the-art LLMs and Multimodal LLMs (MLLMs) perform well on\nbasic traffic rules but exhibit significant weaknesses in numerical reasoning\nand complex right-of-way scenarios, traffic sign variations, and spatial\nlayouts, (2) fine-tuning on DriveQA improves accuracy across multiple\ncategories, particularly in regulatory sign recognition and intersection\ndecision-making, (3) controlled variations in DriveQA-V provide insights into\nmodel sensitivity to environmental factors such as lighting, perspective,\ndistance, and weather conditions, and (4) pretraining on DriveQA enhances\ndownstream driving task performance, leading to improved results on real-world\ndatasets such as nuScenes and BDD, while also demonstrating that models can\ninternalize text and synthetic traffic knowledge to generalize effectively\nacross downstream QA tasks.",
        "url": "http://arxiv.org/abs/2508.21824v1",
        "published_date": "2025-08-29T17:59:53+00:00",
        "updated_date": "2025-08-29T17:59:53+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Maolin Wei",
            "Wanzhou Liu",
            "Eshed Ohn-Bar"
        ],
        "tldr": "The paper introduces DriveQA, a new benchmark for evaluating LLMs' driving knowledge, revealing weaknesses in complex scenarios and showing that fine-tuning and pretraining on DriveQA can improve performance and generalization to real-world driving datasets.",
        "tldr_zh": "该论文介绍了DriveQA，一个新的用于评估LLM驾驶知识的基准，揭示了LLM在复杂场景中的弱点，并表明在DriveQA上进行微调和预训练可以提高性能并泛化到真实世界的驾驶数据集。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Mapping like a Skeptic: Probabilistic BEV Projection for Online HD Mapping",
        "summary": "Constructing high-definition (HD) maps from sensory input requires accurately\nmapping the road elements in image space to the Bird's Eye View (BEV) space.\nThe precision of this mapping directly impacts the quality of the final\nvectorized HD map. Existing HD mapping approaches outsource the projection to\nstandard mapping techniques, such as attention-based ones. However, these\nmethods struggle with accuracy due to generalization problems, often\nhallucinating non-existent road elements. Our key idea is to start with a\ngeometric mapping based on camera parameters and adapt it to the scene to\nextract relevant map information from camera images. To implement this, we\npropose a novel probabilistic projection mechanism with confidence scores to\n(i) refine the mapping to better align with the scene and (ii) filter out\nirrelevant elements that should not influence HD map generation. In addition,\nwe improve temporal processing by using confidence scores to selectively\naccumulate reliable information over time. Experiments on new splits of the\nnuScenes and Argoverse2 datasets demonstrate improved performance over\nstate-of-the-art approaches, indicating better generalization. The improvements\nare particularly pronounced on nuScenes and in the challenging long perception\nrange. Our code and model checkpoints are available at\nhttps://github.com/Fatih-Erdogan/mapping-like-skeptic .",
        "url": "http://arxiv.org/abs/2508.21689v1",
        "published_date": "2025-08-29T14:55:33+00:00",
        "updated_date": "2025-08-29T14:55:33+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Fatih Erdoğan",
            "Merve Rabia Barın",
            "Fatma Güney"
        ],
        "tldr": "This paper introduces a novel probabilistic Bird's Eye View (BEV) projection method for online HD mapping that uses confidence scores to refine geometric mappings and filter irrelevant elements, demonstrating improved performance on nuScenes and Argoverse2 datasets.",
        "tldr_zh": "该论文提出了一种新的概率鸟瞰图 (BEV) 投影方法，用于在线高清地图构建，该方法使用置信度分数来改进几何映射并过滤掉不相关的元素，并在 nuScenes 和 Argoverse2 数据集上展示了改进的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Mini Autonomous Car Driving based on 3D Convolutional Neural Networks",
        "summary": "Autonomous driving applications have become increasingly relevant in the\nautomotive industry due to their potential to enhance vehicle safety,\nefficiency, and user experience, thereby meeting the growing demand for\nsophisticated driving assistance features. However, the development of reliable\nand trustworthy autonomous systems poses challenges such as high complexity,\nprolonged training periods, and intrinsic levels of uncertainty. Mini\nAutonomous Cars (MACs) are used as a practical testbed, enabling validation of\nautonomous control methodologies on small-scale setups. This simplified and\ncost-effective environment facilitates rapid evaluation and comparison of\nmachine learning models, which is particularly useful for algorithms requiring\nonline training. To address these challenges, this work presents a methodology\nbased on RGB-D information and three-dimensional convolutional neural networks\n(3D CNNs) for MAC autonomous driving in simulated environments. We evaluate the\nproposed approach against recurrent neural networks (RNNs), with architectures\ntrained and tested on two simulated tracks with distinct environmental\nfeatures. Performance was assessed using task completion success, lap-time\nmetrics, and driving consistency. Results highlight how architectural\nmodifications and track complexity influence the models' generalization\ncapability and vehicle control performance. The proposed 3D CNN demonstrated\npromising results when compared with RNNs.",
        "url": "http://arxiv.org/abs/2508.21271v1",
        "published_date": "2025-08-29T00:21:34+00:00",
        "updated_date": "2025-08-29T00:21:34+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Pablo Moraes",
            "Monica Rodriguez",
            "Kristofer S. Kappel",
            "Hiago Sodre",
            "Santiago Fernandez",
            "Igor Nunes",
            "Bruna Guterres",
            "Ricardo Grando"
        ],
        "tldr": "This paper proposes a 3D CNN-based method for mini autonomous car driving using RGB-D data in simulated environments, comparing its performance to RNNs on metrics like task completion and lap time.",
        "tldr_zh": "本文提出了一种基于3D CNN的方法，利用RGB-D数据在模拟环境中进行迷你自动驾驶汽车的驾驶，并通过任务完成度和单圈时间等指标将其性能与RNN进行比较。",
        "relevance_score": 8,
        "novelty_claim_score": 6,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]