[
    {
        "title": "BLIP-FusePPO: A Vision-Language Deep Reinforcement Learning Framework for Lane Keeping in Autonomous Vehicles",
        "summary": "In this paper, we propose Bootstrapped Language-Image Pretraining-driven\nFused State Representation in Proximal Policy Optimization (BLIP-FusePPO), a\nnovel multimodal reinforcement learning (RL) framework for autonomous\nlane-keeping (LK), in which semantic embeddings generated by a vision-language\nmodel (VLM) are directly fused with geometric states, LiDAR observations, and\nProportional-Integral-Derivative-based (PID) control feedback within the agent\nobservation space. The proposed method lets the agent learn driving rules that\nare aware of their surroundings and easy to understand by combining high-level\nscene understanding from the VLM with low-level control and spatial signals.\nOur architecture brings together semantic, geometric, and control-aware\nrepresentations to make policy learning more robust. A hybrid reward function\nthat includes semantic alignment, LK accuracy, obstacle avoidance, and speed\nregulation helps learning to be more efficient and generalizable. Our method is\ndifferent from the approaches that only use semantic models to shape rewards.\nInstead, it directly embeds semantic features into the state representation.\nThis cuts down on expensive runtime inference and makes sure that semantic\nguidance is always available. The simulation results show that the proposed\nmodel is better at LK stability and adaptability than the best vision-based and\nmultimodal RL baselines in a wide range of difficult driving situations. We\nmake our code publicly available.",
        "url": "http://arxiv.org/abs/2510.22370v1",
        "published_date": "2025-10-25T17:27:08+00:00",
        "updated_date": "2025-10-25T17:27:08+00:00",
        "categories": [
            "cs.RO",
            "cs.AI",
            "cs.CV",
            "cs.LG",
            "cs.SE"
        ],
        "authors": [
            "Seyed Ahmad Hosseini Miangoleh",
            "Amin Jalal Aghdasian",
            "Farzaneh Abdollahi"
        ],
        "tldr": "The paper introduces BLIP-FusePPO, a novel multimodal RL framework for autonomous lane-keeping that fuses vision-language embeddings with geometric states and control feedback, demonstrating improved stability and adaptability in challenging driving scenarios.",
        "tldr_zh": "本文介绍了一种新颖的多模态强化学习框架BLIP-FusePPO，用于自动车道保持，该框架将视觉-语言嵌入与几何状态和控制反馈融合，在具有挑战性的驾驶场景中表现出更高的稳定性和适应性。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Accident Anticipation via Temporal Occurrence Prediction",
        "summary": "Accident anticipation aims to predict potential collisions in an online\nmanner, enabling timely alerts to enhance road safety. Existing methods\ntypically predict frame-level risk scores as indicators of hazard. However,\nthese approaches rely on ambiguous binary supervision (labeling all frames in\naccident videos as positive) despite the fact that risk varies continuously\nover time, leading to unreliable learning and false alarms. To address this, we\npropose a novel paradigm that shifts the prediction target from current-frame\nrisk scoring to directly estimating accident scores at multiple future time\nsteps (e.g., 0.1s-2.0s ahead), leveraging precisely annotated accident\ntimestamps as supervision. Our method employs a snippet-level encoder to\njointly model spatial and temporal dynamics, and a Transformer-based temporal\ndecoder that predicts accident scores for all future horizons simultaneously\nusing dedicated temporal queries. Furthermore, we introduce a refined\nevaluation protocol that reports Time-to-Accident (TTA) and recall (evaluated\nat multiple pre-accident intervals (0.5s, 1.0s, and 1.5s)) only when the false\nalarm rate (FAR) remains within an acceptable range, ensuring practical\nrelevance. Experiments show that our method achieves superior performance in\nboth recall and TTA under realistic FAR constraints.",
        "url": "http://arxiv.org/abs/2510.22260v1",
        "published_date": "2025-10-25T11:57:22+00:00",
        "updated_date": "2025-10-25T11:57:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Tianhao Zhao",
            "Yiyang Zou",
            "Zihao Mao",
            "Peilun Xiao",
            "Yulin Huang",
            "Hongda Yang",
            "Yuxuan Li",
            "Qun Li",
            "Guobin Wu",
            "Yutian Lin"
        ],
        "tldr": "This paper proposes a novel accident anticipation method that predicts accident scores at multiple future time steps using a Transformer-based temporal decoder and introduces a refined evaluation protocol considering false alarm rates, showing superior performance.",
        "tldr_zh": "本文提出了一种新颖的事故预测方法，该方法使用基于Transformer的时间解码器预测多个未来时间步长的事故分数，并引入了考虑误报率的精细评估协议，表现出卓越的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "LOC: A General Language-Guided Framework for Open-Set 3D Occupancy Prediction",
        "summary": "Vision-Language Models (VLMs) have shown significant progress in open-set\nchallenges. However, the limited availability of 3D datasets hinders their\neffective application in 3D scene understanding. We propose LOC, a general\nlanguage-guided framework adaptable to various occupancy networks, supporting\nboth supervised and self-supervised learning paradigms. For self-supervised\ntasks, we employ a strategy that fuses multi-frame LiDAR points for\ndynamic/static scenes, using Poisson reconstruction to fill voids, and\nassigning semantics to voxels via K-Nearest Neighbor (KNN) to obtain\ncomprehensive voxel representations. To mitigate feature over-homogenization\ncaused by direct high-dimensional feature distillation, we introduce Densely\nContrastive Learning (DCL). DCL leverages dense voxel semantic information and\npredefined textual prompts. This efficiently enhances open-set recognition\nwithout dense pixel-level supervision, and our framework can also leverage\nexisting ground truth to further improve performance. Our model predicts dense\nvoxel features embedded in the CLIP feature space, integrating textual and\nimage pixel information, and classifies based on text and semantic similarity.\nExperiments on the nuScenes dataset demonstrate the method's superior\nperformance, achieving high-precision predictions for known classes and\ndistinguishing unknown classes without additional training data.",
        "url": "http://arxiv.org/abs/2510.22141v1",
        "published_date": "2025-10-25T03:27:19+00:00",
        "updated_date": "2025-10-25T03:27:19+00:00",
        "categories": [
            "cs.CV",
            "cs.CL",
            "cs.LG",
            "cs.RO",
            "eess.IV"
        ],
        "authors": [
            "Yuhang Gao",
            "Xiang Xiang",
            "Sheng Zhong",
            "Guoyou Wang"
        ],
        "tldr": "The paper introduces LOC, a language-guided framework for open-set 3D occupancy prediction, leveraging VLMs and contrastive learning to improve performance on datasets like nuScenes without requiring additional training data for unknown classes.",
        "tldr_zh": "该论文介绍了LOC，一个语言引导的开放集3D占用预测框架，利用视觉语言模型和对比学习来提高在nuScenes等数据集上的性能，而无需为未知类别提供额外的训练数据。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Real-Time Semantic Segmentation on FPGA for Autonomous Vehicles Using LMIINet with the CGRA4ML Framework",
        "summary": "Semantic segmentation has emerged as a fundamental problem in computer\nvision, gaining particular importance in real-time applications such as\nautonomous driving. The main challenge is achieving high accuracy while\noperating under computational and hardware constraints. In this research, we\npresent an FPGA-based implementation of real-time semantic segmentation\nleveraging the lightweight LMIINet architecture and the Coarse-Grained\nReconfigurable Array for Machine Learning (CGRA4ML) hardware framework. The\nmodel was trained using Quantization-Aware Training (QAT) with 8-bit precision\non the Cityscapes dataset, reducing memory footprint by a factor of four while\nenabling efficient fixed-point computations. Necessary modifications were\napplied to adapt the model to CGRA4ML constraints, including simplifying skip\nconnections, employing hardware-friendly operations such as depthwise-separable\nand 1A-1 convolutions, and redesigning parts of the Flatten Transformer. Our\nimplementation achieves approximately 90% pixel accuracy and 45% mean\nIntersection-over-Union (mIoU), operating in real-time at 20 frames per second\n(FPS) with 50.1 ms latency on the ZCU104 FPGA board. The results demonstrate\nthe potential of CGRA4ML, with its flexibility in mapping modern layers and\noff-chip memory utilization for skip connections, provides a path for\nimplementing advanced semantic segmentation networks on FPGA for real-time\napplications to outperform traditional GPU solutions in terms of power\nefficiency while maintaining competitive accuracy. The code for this project is\npublicly available at https://github.com/STAmirr/ cgra4ml_semantic_segmentation",
        "url": "http://arxiv.org/abs/2510.22243v1",
        "published_date": "2025-10-25T10:16:22+00:00",
        "updated_date": "2025-10-25T10:16:22+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Amir Mohammad Khadem Hosseini",
            "Sattar Mirzakuchaki"
        ],
        "tldr": "This paper presents a real-time semantic segmentation implementation on an FPGA for autonomous vehicles using LMIINet and the CGRA4ML framework, achieving 90% pixel accuracy and 45% mIoU at 20 FPS. The authors also provide public code.",
        "tldr_zh": "本文提出了一种基于FPGA的实时语义分割实现方案，用于自动驾驶车辆，采用LMIINet和CGRA4ML框架，实现了90%的像素精度和45%的mIoU，帧率为20 FPS。作者同时公开了代码。",
        "relevance_score": 8,
        "novelty_claim_score": 6,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "LT-Exosense: A Vision-centric Multi-session Mapping System for Lifelong Safe Navigation of Exoskeletons",
        "summary": "Self-balancing exoskeletons offer a promising mobility solution for\nindividuals with lower-limb disabilities. For reliable long-term operation,\nthese exoskeletons require a perception system that is effective in changing\nenvironments. In this work, we introduce LT-Exosense, a vision-centric,\nmulti-session mapping system designed to support long-term (semi)-autonomous\nnavigation for exoskeleton users. LT-Exosense extends single-session mapping\ncapabilities by incrementally fusing spatial knowledge across multiple\nsessions, detecting environmental changes, and updating a persistent global\nmap. This representation enables intelligent path planning, which can adapt to\nnewly observed obstacles and can recover previous routes when obstructions are\nremoved. We validate LT-Exosense through several real-world experiments,\ndemonstrating a scalable multi-session map that achieves an average\npoint-to-point error below 5 cm when compared to ground-truth laser scans. We\nalso illustrate the potential application of adaptive path planning in\ndynamically changing indoor environments.",
        "url": "http://arxiv.org/abs/2510.22164v1",
        "published_date": "2025-10-25T05:23:50+00:00",
        "updated_date": "2025-10-25T05:23:50+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Jianeng Wang",
            "Matias Mattamala",
            "Christina Kassab",
            "Nived Chebrolu",
            "Guillaume Burger",
            "Fabio Elnecave",
            "Marine Petriaux",
            "Maurice Fallon"
        ],
        "tldr": "The paper introduces LT-Exosense, a vision-centric multi-session mapping system for long-term exoskeleton navigation that incrementally fuses spatial knowledge across sessions, detects environmental changes, and enables adaptive path planning. Experiments demonstrate a scalable map with low point-to-point error.",
        "tldr_zh": "该论文介绍了LT-Exosense，一个以视觉为中心的多会话地图系统，用于外骨骼的长期导航，该系统可以增量融合跨会话的空间知识，检测环境变化，并实现自适应路径规划。实验表明，该系统可扩展，且地图具有较低的点对点误差。",
        "relevance_score": 7,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]