[
    {
        "title": "DreamDojo: A Generalist Robot World Model from Large-Scale Human Videos",
        "summary": "Being able to simulate the outcomes of actions in varied environments will revolutionize the development of generalist agents at scale. However, modeling these world dynamics, especially for dexterous robotics tasks, poses significant challenges due to limited data coverage and scarce action labels. As an endeavor towards this end, we introduce DreamDojo, a foundation world model that learns diverse interactions and dexterous controls from 44k hours of egocentric human videos. Our data mixture represents the largest video dataset to date for world model pretraining, spanning a wide range of daily scenarios with diverse objects and skills. To address the scarcity of action labels, we introduce continuous latent actions as unified proxy actions, enhancing interaction knowledge transfer from unlabeled videos. After post-training on small-scale target robot data, DreamDojo demonstrates a strong understanding of physics and precise action controllability. We also devise a distillation pipeline that accelerates DreamDojo to a real-time speed of 10.81 FPS and further improves context consistency. Our work enables several important applications based on generative world models, including live teleoperation, policy evaluation, and model-based planning. Systematic evaluation on multiple challenging out-of-distribution (OOD) benchmarks verifies the significance of our method for simulating open-world, contact-rich tasks, paving the way for general-purpose robot world models.",
        "url": "http://arxiv.org/abs/2602.06949v1",
        "published_date": "2026-02-06T18:49:43+00:00",
        "updated_date": "2026-02-06T18:49:43+00:00",
        "categories": [
            "cs.RO",
            "cs.AI",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Shenyuan Gao",
            "William Liang",
            "Kaiyuan Zheng",
            "Ayaan Malik",
            "Seonghyeon Ye",
            "Sihyun Yu",
            "Wei-Cheng Tseng",
            "Yuzhu Dong",
            "Kaichun Mo",
            "Chen-Hsuan Lin",
            "Qianli Ma",
            "Seungjun Nah",
            "Loic Magne",
            "Jiannan Xiang",
            "Yuqi Xie",
            "Ruijie Zheng",
            "Dantong Niu",
            "You Liang Tan",
            "K. R. Zentner",
            "George Kurian",
            "Suneel Indupuru",
            "Pooya Jannaty",
            "Jinwei Gu",
            "Jun Zhang",
            "Jitendra Malik",
            "Pieter Abbeel",
            "Ming-Yu Liu",
            "Yuke Zhu",
            "Joel Jang",
            "Linxi \"Jim\" Fan"
        ],
        "tldr": "DreamDojo introduces a foundation world model for robotics, pre-trained on a massive dataset of human videos, demonstrating strong performance in physics understanding and action controllability after fine-tuning on robot data. This enables applications like teleoperation and model-based planning.",
        "tldr_zh": "DreamDojo 提出了一个机器人基础世界模型，该模型在一个大型人类视频数据集上进行了预训练，在机器人数据上进行微调后，在物理理解和动作可控性方面表现出强大的性能，从而支持远程操作和基于模型的规划等应用。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]